{"welcome":"Welcome to","title":"Cloud Zoo","update":"Videos last updated <span class=update></span>","questions":[{"type":"text","value":"<strong>Feeling a little down?</strong>"},{"type":"text","value":"<strong>In need of some cute animal therapy?</strong>"},{"type":"text","value":"<br>"},{"type":"text","value":"We’ve got you."}],"intro":[{"type":"text","value":"Every day, the activities of hundreds of zoo and aquarium animals are live streamed online. Throughout the day we generate short clips from each of these cameras and collect them right here in our digital zoo. Click on any video clip to learn more about the animals and to go to the full live stream. Learn more about how the zoo works in the <a href=#methods>methods</a>."},{"type":"text","value":"<span class=sig>Your digital zookeepers, <a href=pudding.cool/author/rj-andrews>RJ Andrews</a> and <a href=pudding.cool/author/amber-thomas>Amber Thomas</a></sig>"}],"methods":[{"type":"text","value":"Zoo and aquarium cameras were collected from Google searches, listicles, and the website <a href=https://zoocamerasaroundtheworld.com/>Zoo Cameras Around the World</a>. Throughout the day each day, a script runs, launching a headless browser using <a href=https://github.com/microsoft/playwright>Microsoft Playwright</a>. This browser navigates to each camera, collects 15 screenshots, and leaves the camera’s page to conserve bandwidth for each facility’s website. The screenshots are then rendered into a GIF using <a href=https://github.com/benjaminadk/gif-encoder-2>gif-encoder-2</a>. Due to the automatic nature of GIF creation and the reliance on live streams that we do not personally operate or maintain, you may sometimes see some glitchiness. If you see a consistent issue (like a camera appears to be permanently turned off), please let us know at <a href=mailto:amber@polygraph.cool>amber@polygraph.cool</a>."},{"type":"text","value":"The cameras are arranged on this page based (roughly) on the location of each animal’s natural habitat. Animals with similar natural ranges are grouped together. This may not be completely accurate as some animals (particularly ocean-dwelling animals) have very large natural ranges and some zoo and aquarium exhibits showcase multiple species with slightly different natural ranges."}]}